InformationRegisters/НастройкиСервисаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСервисаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименования информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Comment>Идентификатор приложения в сервисе, в котором развернута информационная система</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьАбонентСервисаИнициализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяАктивацияТестовогоТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТестовыйТарифАктивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСообщениеОбАктивацииТестовогоТарифаОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисЗаблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяОбновитьНастройкиФункциональности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПриложенияПоИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПриложенияПоИмениДоступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновитьУровеньДоступаКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСервисаКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиСервиса() Экспорт
	
	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиСервисаКабинетСотрудника);
							
	Возврат СтруктураНастроек;

КонецФункции

Процедура ВключитьВыполнениеРегламентногоЗадания() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ВыполнятьРегламентноеЗадание = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСостояниеБлокировкиСервиса(СервисЗаблокирован) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если СервисЗаблокирован <> НаборЗаписей[0].СервисЗаблокирован Тогда
			НаборЗаписей[0].СервисЗаблокирован = СервисЗаблокирован;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.СервисЗаблокирован = СервисЗаблокирован;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВерсиюПриложения(ВерсияПриложения) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияПриложения <> НаборЗаписей[0].ВерсияПриложения Тогда
			НаборЗаписей[0].ВерсияПриложения = ВерсияПриложения;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияПриложения = ВерсияПриложения;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТребуетсяОбновитьНастройкиФункциональности(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].ТребуетсяОбновитьНастройкиФункциональности Тогда
			НаборЗаписей[0].ТребуетсяОбновитьНастройкиФункциональности = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ТребуетсяОбновитьНастройкиФункциональности = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАдресПриложенияПоИмениДоступен(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].АдресПриложенияПоИмениДоступен Тогда
			НаборЗаписей[0].АдресПриложенияПоИмениДоступен = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.АдресПриложенияПоИмениДоступен = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВерсиюAPI(ВерсияAPI) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияAPI <> НаборЗаписей[0].ВерсияAPI Тогда
			НаборЗаписей[0].ВерсияAPI = ВерсияAPI;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияAPI = ВерсияAPI;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВерсиюФормата(ВерсияФормата) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияФормата <> НаборЗаписей[0].ВерсияФормата Тогда
			НаборЗаписей[0].ВерсияФормата = ВерсияФормата;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияФормата = ВерсияФормата;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОбновитьУровеньДоступаКИ(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].ОбновитьУровеньДоступаКИ Тогда
			НаборЗаписей[0].ОбновитьУровеньДоступаКИ = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ОбновитьУровеньДоступаКИ = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
